namespace CshBook.Ответы.Глава_0;

public class ForSolutions
{
    public static void Main_()
    {

    // Выведите на экран n раз фразу "Silence is golden". Число n вводит пользователь.
    int n = int.Parse(Console.ReadLine());
    
    for (int i = 0; i < n; i++)
    {
        Console.WriteLine("Silence is golden");
    }



    // Выведите на экран прямоугольник из нулей. Количество строк вводит пользователь, количество столбцов равно 5.
    
    int rows = int.Parse(Console.ReadLine());
    for (int i = 0; i < rows; i++)
    {
        for (int j = 0; j < 5; j++)
        {
            Console.Write("0");
        }
        Console.WriteLine();
    }
    
    
    
    // Вывести на экран фигуру из звездочек:
    // *******
    // *******
    // *******
    // *******
    // (квадрат из n строк, в каждой строке n звездочек)
    
    
    
    
    
    // Вывести на экран числа от 1000 до 9999 такие, что среди цифр есть цифра 3.
    //
    // Выведите на экран строки вида:
    // *******
    // ****
    // *******
    // ****
    // *******
    // ****
    // (всего n строк, звездочек или 7, или 4 по очереди)
    //
    //
    // Вывести на экран:
    // AAABBBAAABBBAAABBB
    // BBBAAABBBAAABBBAAA
    // AAABBBAAABBBAAABBB
    // (таких строк n, в каждой строке m троек AAA)
    //
    // Вывести на экран:
    // AAAAAAAAAAAAAAAA
    // ABBBBBBBBBBBBBBA
    // ABBBBBBBBBBBBBBA
    // ABBBBBBBBBBBBBBA
    // AAAAAAAAAAAAAAAA
    // (количество строк вводит пользователь, ширина прямоугольника в два раза больше высоты)
    //
    // Выведите на экран квадрат из нулей и единиц, причем нули находятся только на диагонали квадрата. Всего в квадрате сто цифр. Обе диагонали состоят из 0
    //
    // Вывести на экран числа от 1 до 100, которые делятся на 3 или на 5.
    //
    // Вывести на экран таблицу умножения для числа n (n вводит пользователь).
    //
    // Вывести на экран все четные числа от 1 до n (n вводит пользователь).
    //
    // Вывести на экран сумму всех чисел от 1 до n (n вводит пользователь).
    //
    // Вывести на экран все числа от 1 до n, которые являются простыми.
    //
    // Вывести на экран треугольник из звездочек:
    //
    // *
    // **
    // ***
    // ****
    // *****
    // (количество строк вводит пользователь)
    //
    // Вывести на экран числа Фибоначчи до n-го числа (n вводит пользователь).
    //
    // Вывести на экран все числа от 1 до n, которые являются палиндромами (читаются одинаково слева направо и справа налево).
    //
    // Вывести на экран все числа от 1 до n, которые являются совершенными (сумма делителей числа равна самому числу, например, 6 = 1 + 2 + 3).
    //
    // Вывести на экран все числа от 1 до n, которые являются автоморфными (квадрат числа заканчивается на само число, например, 5^2 = 25).
    //
    // Вывести на экран все числа от 1 до n, которые являются кубом другого числа.
    //
    // Вывести на экран все числа от 1 до n, которые являются степенью двойки.
    //
    // Вывести на экран все числа от 1 до n, которые являются степенью тройки.
    //
    // Вывести на экран все числа от 1 до n, которые являются степенью пятерки.
    //
    // Вывести на экран все числа от 1 до n, которые являются степенью десятки.
    //
    // Вывести на экран все числа от 1 до n, которые являются степенью числа 11.
    //
    // Вывести на экран все числа от 1 до n, которые являются степенью числа 13.
    //
    // Вывести на экран все числа от 1 до n, которые являются степенью числа 17.
    //
    // Вывести на экран все числа от 1 до n, которые являются степенью числа 19.
    //
    // Вывести на экран все числа от 1 до n, которые являются степенью числа 23.
    //  



    }
}