using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace CshBook.Lessons
{
    /* Конструкторы
    
    Вспомним наш прошлый пример с питомцами. 
    Неудобно заполнять вручную поля. 
    Поэтому есть конструкторы, которые вызываются при создании экземпляра класса.

    Так же можно наследовать конструкторы, чтобы была гибкость.
     */


    /* Деструкторы
    Вызываются, когда наш экземпляр класса уничтожается сборщиком мусора.
    Мы не можем предугадать когда это точно произойдёт. 
    Однако, можно считать тогда, когда ссылка не объект перестаёт использоваться кодом
     
     */


    /* Ссылки
     
     */


    internal class EighteenthLesson
    {

    }
}
